app/views/messages/index.haml

SELECT `users`.`name` FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 1
---
          Members:
          - @group.users.pluck(:name).each do |user|