app/controllers/groups_controller.rb

INSERT INTO `group_users` (`group_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, '2019-03-02 12:48:34', '2019-03-02 12:48:34')
---
  def new
    @group = Group.new
    @group.users << current_user

INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('くそくそくそ', '2019-03-02 12:48:34', '2019-03-02 12:48:34')
---
  def create

    @group = Group.new(group_params)
    if @group.save